ammarRajabA/ENC28J60-LAN/CCS_5 C code/TCPIP/PIC18F4585_registers.h
RCONBITS RCONbits;
#byte RCONbits = 0xFD0
#byte RCON = 0xFD0

#word TMR1 = 0xFCE
#byte TMR1H = 0xFCF
#byte TMR1L = 0xFCE

typedef struct 
 {
   union {
      struct {
         unsigned int :2;
         unsigned int T1INSYNC:1;
      };

      struct {
         unsigned int TMR1ON:1;
         unsigned int TMR1CS:1;
         unsigned int T1SYNC:1;
         unsigned int T1OSCEN:1;
         unsigned int T1CKPS0:2;
         unsigned int T1RUN:1;
         unsigned int RD16:1;
      };
   };
      struct {
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int T1CKPS:2;
      };
} T1CONBITS;
T1CONBITS T1CONbits;
#byte T1CONbits = 0xFCD
#byte T1CON = 0xFCD

#byte TMR2 = 0xFCC

#byte PR2 = 0xFCB

typedef union 
 {
   union {
      struct {
         unsigned int :3;
         unsigned int TOUTPS0:4;
      };
      struct {
         unsigned int :3;
         unsigned int TOUTPS:4;
      };

      struct {
         unsigned int T2CKPS0:2;
         unsigned int TMR2ON:1;
         unsigned int T2OUTPS0:4;
      };
   };
      struct {
         unsigned int T2CKPS:2;
         unsigned int :1;
         unsigned int T2OUTPS:4;
      };
} T2CONBITS;
T2CONBITS T2CONbits;
#byte T2CONbits = 0xFCA
#byte T2CON = 0xFCA

#byte SSPBUF = 0xFC9

#byte SSPADD = 0xFC8

typedef struct 
 {
   union {
      struct {
         unsigned int :2;
         unsigned int R_W:1;
         unsigned int :2;
         unsigned int D_A:1;
      };

   union {
      struct {
         unsigned int :2;
         unsigned int I2C_READ:1;
         unsigned int I2C_START:1;
         unsigned int I2C_STOP:1;
         unsigned int I2C_DAT:1;
      };
   };

   union {
      struct {
         unsigned int :2;
         unsigned int WRITE:1;
         unsigned int :2;
         unsigned int ADDRESS:1;
      };
   };

   union {
      struct {
         unsigned int :2;
         unsigned int READ_WRITE:1;
         unsigned int :2;
         unsigned int DATA_ADDRESS:1;
      };
   };

   union {
      struct {
         unsigned int :2;
         unsigned int W:1;
         unsigned int :2;
         unsigned int A:1;
      };
   };

      struct {
         unsigned int BF:1;
         unsigned int UA:1;
         unsigned int R:1;
         unsigned int S:1;
         unsigned int P:1;
         unsigned int D:1;
         unsigned int CKE:1;
         unsigned int SMP:1;
      };
   };
} SSPSTATBITS;
SSPSTATBITS SSPSTATbits;
#byte SSPSTATbits = 0xFC7
#byte SSPSTAT = 0xFC7

typedef union 
 {
      struct {
         unsigned int SSPM0:4;
         unsigned int CKP:1;
         unsigned int SSPEN:1;
         unsigned int SSPOV:1;
         unsigned int WCOL:1;
      };
      struct {
         unsigned int SSPM:4;
      };
} SSPCON1BITS;
SSPCON1BITS SSPCON1bits;
#byte SSPCON1bits = 0xFC6
#byte SSPCON1 = 0xFC6

typedef struct 
 {
   unsigned int SEN:1;
   unsigned int RSEN:1;
   unsigned int PEN:1;
   unsigned int RCEN:1;
   unsigned int ACKEN:1;
   unsigned int ACKDT:1;
   unsigned int ACKSTAT:1;
   unsigned int GCEN:1;
} SSPCON2BITS;
SSPCON2BITS SSPCON2bits;
#byte SSPCON2bits = 0xFC5
#byte SSPCON2 = 0xFC5

#word ADRES = 0xFC3
#byte ADRESH = 0xFC4
#byte ADRESL = 0xFC3

typedef struct 
 {
   union {
      struct {
         unsigned int :1;
         unsigned int GO_DONE:1;
      };

   union {
      struct {
         unsigned int :1;
         unsigned int DONE:1;
      };
   };

      struct {
         unsigned int ADON:1;
         unsigned int GO:1;
         unsigned int CHS0:4;
      };
   };
      struct {
         unsigned int :1;
         unsigned int :1;
         unsigned int CHS:4;
      };
} ADCON0BITS;
ADCON0BITS ADCON0bits;
#byte ADCON0bits = 0xFC2
#byte ADCON0 = 0xFC2

typedef union 
 {
      struct {
         unsigned int PCFG0:4;
         unsigned int VCFG0:2;
      };
      struct {
         unsigned int PCFG:4;
         unsigned int VCFG:2;
      };
} ADCON1BITS;
ADCON1BITS ADCON1bits;
#byte ADCON1bits = 0xFC1
#byte ADCON1 = 0xFC1

typedef union 
 {
      struct {
         unsigned int ADCS0:3;
         unsigned int ACQT0:3;
         unsigned int :1;
         unsigned int ADFM:1;
      };
      struct {
         unsigned int ADCS:3;
         unsigned int ACQT:3;
      };
} ADCON2BITS;
ADCON2BITS ADCON2bits;
#byte ADCON2bits = 0xFC0
#byte ADCON2 = 0xFC0

#word CCPR1 = 0xFBE
#byte CCPR1H = 0xFBF
#byte CCPR1L = 0xFBE

typedef union 
 {
      struct {
         unsigned int CCP1M0:4;
         unsigned int DC1B0:2;
      };
      struct {
         unsigned int CCP1M:4;
         unsigned int DC1B:2;
      };
} CCP1CONBITS;
CCP1CONBITS CCP1CONbits;
#byte CCP1CONbits = 0xFBD
#byte CCP1CON = 0xFBD

#word ECCPR1 = 0xFBB
#byte ECCPR1H = 0xFBC
#byte ECCPR1L = 0xFBB

typedef union 
 {
      struct {
         unsigned int ECCP1M0:4;
         unsigned int EDC1B0:2;
         unsigned int EPWM1M0:2;
      };
      struct {
         unsigned int ECCP1M:4;
         unsigned int EDC1B:2;
         unsigned int EPWM1M:2;
      };
} ECCP1CONBITS;
ECCP1CONBITS ECCP1CONbits;
#byte ECCP1CONbits = 0xFBA
#byte ECCP1CON = 0xFBA

typedef struct 
 {
   union {
      struct {
         unsigned int ABDEN:1;
         unsigned int WUE:1;
         unsigned int :1;
         unsigned int BRG16:1;
         unsigned int TXCKP:1;
         unsigned int RXDTP:1;
         unsigned int RCIDL:1;
         unsigned int ABDOVF:1;
      };

      struct {
         unsigned int :4;
         unsigned int SCKP:1;
      };
   };
} BAUDCONBITS;
BAUDCONBITS BAUDCONbits;
#byte BAUDCONbits = 0xFB8
#byte BAUDCON = 0xFB8

typedef union 
 {
      struct {
         unsigned int PDC0:7;
         unsigned int PRSEN:1;
      };
      struct {
         unsigned int PDC:7;
      };
} ECCP1DELBITS;
ECCP1DELBITS ECCP1DELbits;
#byte ECCP1DELbits = 0xFB7
#byte ECCP1DEL = 0xFB7

typedef union 
 {
      struct {
         unsigned int PSSBD0:2;
         unsigned int PSSAC0:2;
         unsigned int ECCPAS0:3;
         unsigned int ECCPASE:1;
      };
      struct {
         unsigned int PSSBD:2;
         unsigned int PSSAC:2;
         unsigned int ECCPAS:3;
      };
} ECCP1ASBITS;
