ammarRajabA/ENC28J60-LAN/CCS_5 C code/TCPIP/PIC18F4585_registers.h
ECCP1ASBITS ECCP1ASbits;
#byte ECCP1ASbits = 0xFB6
#byte ECCP1AS = 0xFB6

typedef union 
 {
   union {
      struct {
         unsigned int CVR0:4;
         unsigned int CVRSS:1;
         unsigned int CVRR:1;
         unsigned int CVROE:1;
         unsigned int CVREN:1;
      };
      struct {
         unsigned int CVR:4;
      };

      struct {
         unsigned int :4;
         unsigned int CVREF:1;
      };
   };
} CVRCONBITS;
CVRCONBITS CVRCONbits;
#byte CVRCONbits = 0xFB5
#byte CVRCON = 0xFB5

typedef union 
 {
      struct {
         unsigned int CM0:3;
         unsigned int CIS:1;
         unsigned int C1INV:1;
         unsigned int C2INV:1;
         unsigned int C1OUT:1;
         unsigned int C2OUT:1;
      };
      struct {
         unsigned int CM:3;
      };
} CMCONBITS;
CMCONBITS CMCONbits;
#byte CMCONbits = 0xFB4
#byte CMCON = 0xFB4

#word TMR3 = 0xFB2
#byte TMR3H = 0xFB3
#byte TMR3L = 0xFB2

typedef union 
 {
   union {
      struct {
         unsigned int TMR3ON:1;
         unsigned int TMR3CS:1;
         unsigned int T3SYNC:1;
         unsigned int T3CCP1:1;
         unsigned int T3CKPS0:2;
         unsigned int T3ECCP1:1;
         unsigned int RD16:1;
      };
      struct {
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int T3CKPS:2;
      };

      struct {
         unsigned int :2;
         unsigned int T3NSYNC:1;
         unsigned int :3;
         unsigned int T3CCP2:1;
      };
   };
} T3CONBITS;
T3CONBITS T3CONbits;
#byte T3CONbits = 0xFB1
#byte T3CON = 0xFB1

#byte SPBRGH = 0xFB0

#byte SPBRG = 0xFAF

#byte RCREG = 0xFAE

#byte TXREG = 0xFAD

typedef struct 
 {
   unsigned int TX9D:1;
   unsigned int TRMT:1;
   unsigned int BRGH:1;
   unsigned int SENDB:1;
   unsigned int SYNC:1;
   unsigned int TXEN:1;
   unsigned int TX9:1;
   unsigned int CSRC:1;
} TXSTABITS;
TXSTABITS TXSTAbits;
#byte TXSTAbits = 0xFAC
#byte TXSTA = 0xFAC

typedef struct 
 {
   union {
      struct {
         unsigned int RX9D:1;
         unsigned int OERR:1;
         unsigned int FERR:1;
         unsigned int ADDEN:1;
         unsigned int CREN:1;
         unsigned int SREN:1;
         unsigned int RX9:1;
         unsigned int SPEN:1;
      };

      struct {
         unsigned int :3;
         unsigned int ADEN:1;
      };
   };
} RCSTABITS;
RCSTABITS RCSTAbits;
#byte RCSTAbits = 0xFAB
#byte RCSTA = 0xFAB

#byte EEADRH = 0xFAA

#byte EEADR = 0xFA9

#byte EEDATA = 0xFA8

#byte EECON2 = 0xFA7

typedef struct 
 {
   unsigned int RD:1;
   unsigned int WR:1;
   unsigned int WREN:1;
   unsigned int WRERR:1;
   unsigned int FREE:1;
   unsigned int :1;
   unsigned int CFGS:1;
   unsigned int EEPGD:1;
} EECON1BITS;
EECON1BITS EECON1bits;
#byte EECON1bits = 0xFA6
#byte EECON1 = 0xFA6

typedef struct 
 {
   union {
      struct {
         unsigned int FIFOWMIP:1;
         unsigned int RXBnIP:1;
         unsigned int :2;
         unsigned int TXBnIP:1;
      };

      struct {
         unsigned int RXB0IP:1;
         unsigned int RXB1IP:1;
         unsigned int TXB0IP:1;
         unsigned int TXB1IP:1;
         unsigned int TXB2IP:1;
         unsigned int ERRIP:1;
         unsigned int WAKIP:1;
         unsigned int IRXIP:1;
      };
   };
} IPR3BITS;
IPR3BITS IPR3bits;
#byte IPR3bits = 0xFA5
#byte IPR3 = 0xFA5

typedef struct 
 {
   union {
      struct {
         unsigned int RXB0IF:1;
         unsigned int RXB1IF:1;
         unsigned int TXB0IF:1;
         unsigned int TXB1IF:1;
         unsigned int TXB2IF:1;
         unsigned int ERRIF:1;
         unsigned int WAKIF:1;
         unsigned int IRXIF:1;
      };

      struct {
         unsigned int FIFOWMIF:1;
         unsigned int RXBnIF:1;
         unsigned int :2;
         unsigned int TXBnIF:1;
      };
   };
} PIR3BITS;
PIR3BITS PIR3bits;
#byte PIR3bits = 0xFA4
#byte PIR3 = 0xFA4

typedef struct 
 {
   union {
      struct {
         unsigned int RXB0IE:1;
         unsigned int RXB1IE:1;
         unsigned int TXB0IE:1;
         unsigned int TXB1IE:1;
         unsigned int TXB2IE:1;
         unsigned int ERRIE:1;
         unsigned int WAKIE:1;
         unsigned int IRXIE:1;
      };

   union {
      struct {
         unsigned int FIFOWMIE:1;
         unsigned int RXBnIE:1;
         unsigned int :2;
         unsigned int TXBnIE:1;
      };
   };

      struct {
         unsigned int FIFOMWIE:1;
      };
   };
} PIE3BITS;
PIE3BITS PIE3bits;
#byte PIE3bits = 0xFA3
#byte PIE3 = 0xFA3

typedef struct 
 {
   union {
      struct {
         unsigned int :2;
         unsigned int LVDIP:1;
      };

      struct {
         unsigned int ECCP1IP:1;
         unsigned int TMR3IP:1;
         unsigned int HLVDIP:1;
         unsigned int BCLIP:1;
         unsigned int EEIP:1;
         unsigned int :1;
         unsigned int CMIP:1;
         unsigned int OSCFIP:1;
      };
   };
} IPR2BITS;
IPR2BITS IPR2bits;
#byte IPR2bits = 0xFA2
#byte IPR2 = 0xFA2

typedef struct 
 {
   union {
      struct {
         unsigned int ECCP1IF:1;
         unsigned int TMR3IF:1;
         unsigned int HLVDIF:1;
         unsigned int BCLIF:1;
         unsigned int EEIF:1;
         unsigned int :1;
         unsigned int CMIF:1;
         unsigned int OSCFIF:1;
      };

      struct {
         unsigned int :2;
         unsigned int LVDIF:1;
      };
   };
} PIR2BITS;
PIR2BITS PIR2bits;
#byte PIR2bits = 0xFA1
#byte PIR2 = 0xFA1

typedef struct 
 {
   union {
      struct {
         unsigned int ECCP1IE:1;
         unsigned int TMR3IE:1;
         unsigned int HLVDIE:1;
         unsigned int BCLIE:1;
         unsigned int EEIE:1;
         unsigned int :1;
         unsigned int CMIE:1;
         unsigned int OSCFIE:1;
      };

