ammarRajabA/ENC28J60-LAN/CCS_5 C code/TCPIP/PIC18F4585_registers.h
      struct {
         unsigned int EWIN0:5;
         unsigned int FIFOWM:1;
         unsigned int MDSEL0:2;
      };
   };
      struct {
         unsigned int EWIN:5;
         unsigned int :1;
         unsigned int MDSEL:2;
      };
} ECANCONBITS;
ECANCONBITS ECANCONbits;
#byte ECANCONbits = 0xF77
#byte ECANCON = 0xF77

#byte TXERRCNT = 0xF76

#byte RXERRCNT = 0xF75

typedef struct 
 {
   union {
      struct {
         unsigned int :6;
         unsigned int RXB1OVFL:1;
         unsigned int FIFOEMPTY:1;
      };

      struct {
         unsigned int EWARN:1;
         unsigned int RXWARN:1;
         unsigned int TXWARN:1;
         unsigned int RXBP:1;
         unsigned int TXBP:1;
         unsigned int TXBO:1;
         unsigned int RXBnOVFL:1;
         unsigned int RXB0OVFL:1;
      };
   };
} COMSTATBITS;
COMSTATBITS COMSTATbits;
#byte COMSTATbits = 0xF74
#byte COMSTAT = 0xF74

typedef struct 
 {
   unsigned int :4;
   unsigned int CANCAP:1;
   unsigned int ENDRHI:1;
} CIOCONBITS;
CIOCONBITS CIOCONbits;
#byte CIOCONbits = 0xF73
#byte CIOCON = 0xF73

typedef union 
 {
      struct {
         unsigned int SEG2PH0:3;
         unsigned int :3;
         unsigned int WAKFIL:1;
         unsigned int WAKDIS:1;
      };
      struct {
         unsigned int SEG2PH:3;
         unsigned int :3;
      };
} BRGCON3BITS;
BRGCON3BITS BRGCON3bits;
#byte BRGCON3bits = 0xF72
#byte BRGCON3 = 0xF72

typedef union 
 {
   union {
      struct {
         unsigned int PRSEG0:3;
         unsigned int SEG1PH0:3;
         unsigned int SAM:1;
         unsigned int SEG2PHT:1;
      };
      struct {
         unsigned int PRSEG:3;
         unsigned int SEG1PH:3;
      };

      struct {
         unsigned int :7;
         unsigned int SEG2PHTS:1;
      };
   };
} BRGCON2BITS;
BRGCON2BITS BRGCON2bits;
#byte BRGCON2bits = 0xF71
#byte BRGCON2 = 0xF71

typedef union 
 {
      struct {
         unsigned int BRP0:6;
         unsigned int SJW0:2;
      };
      struct {
         unsigned int BRP:6;
         unsigned int SJW:2;
      };
} BRGCON1BITS;
BRGCON1BITS BRGCON1bits;
#byte BRGCON1bits = 0xF70
#byte BRGCON1 = 0xF70

typedef struct 
 {
   union {
      struct {
         unsigned int :1;
         unsigned int FP1:3;
      };

   union {
      struct {
         unsigned int :1;
         unsigned int WIN0:3;
      };
   };
      struct {
         unsigned int :1;
         unsigned int WIN:3;
      };

      struct {
         unsigned int FP0:1;
         unsigned int WIN0_FP1:1;
         unsigned int WIN1_FP2:1;
         unsigned int WIN2_FP3:1;
         unsigned int ABAT:1;
         unsigned int REQOP0:3;
      };
   };
      struct {
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int REQOP:3;
      };
} CANCONBITS;
CANCONBITS CANCONbits;
#byte CANCONbits = 0xF6F
#byte CANCON = 0xF6F

typedef union 
 {
   union {
      struct {
         unsigned int EICODE0:1;
         unsigned int EICODE1_ICODE0:1;
         unsigned int EICODE2_ICODE1:1;
         unsigned int EICODE3_ICODE2:1;
         unsigned int EICODE4:1;
         unsigned int OPMODE0:3;
      };
      struct {
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int OPMODE:3;
      };

      struct {
         unsigned int :1;
         unsigned int EICODE1:3;
      };
   };
} CANSTATBITS;
CANSTATBITS CANSTATbits;
#byte CANSTATbits = 0xF6E
#byte CANSTAT = 0xF6E

#byte RXB0D7 = 0xF6D

#byte RXB0D6 = 0xF6C

#byte RXB0D5 = 0xF6B

#byte RXB0D4 = 0xF6A

#byte RXB0D3 = 0xF69

#byte RXB0D2 = 0xF68

#byte RXB0D1 = 0xF67

#byte RXB0D0 = 0xF66

typedef union 
 {
   union {
      struct {
         unsigned int DLC0:4;
         unsigned int RB0:2;
         unsigned int RXRTR:1;
      };
      struct {
         unsigned int DLC:4;
         unsigned int RB:2;
      };

      struct {
         unsigned int :4;
         unsigned int RESRB0:2;
      };
   };
      struct {
         unsigned int :4;
         unsigned int RESRB:2;
      };
} RXB0DLCBITS;
RXB0DLCBITS RXB0DLCbits;
#byte RXB0DLCbits = 0xF65
#byte RXB0DLC = 0xF65

#byte RXB0EIDL = 0xF64

typedef struct 
 {
   unsigned int EID8:2;
   unsigned int EID10:6;
} RXB0EIDHBITS;
RXB0EIDHBITS RXB0EIDHbits;
#byte RXB0EIDHbits = 0xF63
#byte RXB0EIDH = 0xF63

typedef union 
 {
      struct {
         unsigned int EID16:2;
         unsigned int :1;
         unsigned int EXID:1;
         unsigned int SRR:1;
         unsigned int SID0:3;
      };
      struct {
         unsigned int EID1:2;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int SID:3;
      };
} RXB0SIDLBITS;
RXB0SIDLBITS RXB0SIDLbits;
#byte RXB0SIDLbits = 0xF62
#byte RXB0SIDL = 0xF62

typedef struct 
 {
   unsigned int SID3:7;
   unsigned int SID10:1;
} RXB0SIDHBITS;
RXB0SIDHBITS RXB0SIDHbits;
#byte RXB0SIDHbits = 0xF61
#byte RXB0SIDH = 0xF61

typedef struct 
 {
   union {
      struct {
         unsigned int :1;
         unsigned int FILHIT1:3;
         unsigned int :1;
         unsigned int RTRRO:1;
      };

   union {
      struct {
         unsigned int FILHIT0:1;
         unsigned int JTOFF_FILHIT1:1;
         unsigned int RXB0DBEN_FILHIT2:1;
         unsigned int RXRTRRO_FILHIT3:1;
         unsigned int FILHIT4:1;
         unsigned int RXM0_RTRRO:1;
         unsigned int RXM1:1;
         unsigned int RXFUL:1;
      };
   };

   union {
      struct {
         unsigned int :2;
         unsigned int RXBODBEN:1;
      };
   };

      struct {
         unsigned int :1;
         unsigned int JTOFF:1;
         unsigned int RXB0DBEN:1;
         unsigned int RXRTRRO:1;
         unsigned int :1;
         unsigned int RXM0:1;
      };
   };
} RXB0CONBITS;
RXB0CONBITS RXB0CONbits;
#byte RXB0CONbits = 0xF60
#byte RXB0CON = 0xF60

typedef union 
 {
   union {
      struct {
         unsigned int :1;
         unsigned int WIN0:3;
      };
      struct {
         unsigned int :1;
         unsigned int WIN:3;
      };

