ammarRajabA/ENC28J60-LAN/CCS_5 C code/TCPIP/PIC18F4585_registers.h
      struct {
         unsigned int FP0:1;
         unsigned int WIN0_FP1:1;
         unsigned int WIN1_FP2:1;
         unsigned int WIN2_FP3:1;
         unsigned int ABAT:1;
         unsigned int REQOP0:3;
      };
   };
      struct {
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int REQOP:3;
      };
} CANCON_RO0BITS;
CANCON_RO0BITS CANCON_RO0bits;
#byte CANCON_RO0bits = 0xF5F
#byte CANCON_RO0 = 0xF5F

typedef union 
 {
      struct {
         unsigned int EICODE0:1;
         unsigned int EICODE1_ICODE0:1;
         unsigned int EICODE2_ICODE1:1;
         unsigned int EICODE3_ICODE2:1;
         unsigned int EICODE4:1;
         unsigned int OPMODE0:3;
      };
      struct {
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int OPMODE:3;
      };
} CANSTAT_RO0BITS;
CANSTAT_RO0BITS CANSTAT_RO0bits;
#byte CANSTAT_RO0bits = 0xF5E
#byte CANSTAT_RO0 = 0xF5E

#byte RXB1D7 = 0xF5D

#byte RXB1D6 = 0xF5C

#byte RXB1D5 = 0xF5B

#byte RXB1D4 = 0xF5A

#byte RXB1D3 = 0xF59

#byte RXB1D2 = 0xF58

#byte RXB1D1 = 0xF57

#byte RXB1D0 = 0xF56

typedef union 
 {
   union {
      struct {
         unsigned int DLC0:4;
         unsigned int RB0:2;
         unsigned int RXRTR:1;
      };
      struct {
         unsigned int DLC:4;
         unsigned int RB:2;
      };

      struct {
         unsigned int :4;
         unsigned int RESRB0:2;
      };
   };
      struct {
         unsigned int :4;
         unsigned int RESRB:2;
      };
} RXB1DLCBITS;
RXB1DLCBITS RXB1DLCbits;
#byte RXB1DLCbits = 0xF55
#byte RXB1DLC = 0xF55

#byte RXB1EIDL = 0xF54

typedef struct 
 {
   unsigned int EID8:2;
   unsigned int EID10:6;
} RXB1EIDHBITS;
RXB1EIDHBITS RXB1EIDHbits;
#byte RXB1EIDHbits = 0xF53
#byte RXB1EIDH = 0xF53

typedef union 
 {
      struct {
         unsigned int EID16:2;
         unsigned int :1;
         unsigned int EXID:1;
         unsigned int SRR:1;
         unsigned int SID0:3;
      };
      struct {
         unsigned int EID1:2;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int SID:3;
      };
} RXB1SIDLBITS;
RXB1SIDLBITS RXB1SIDLbits;
#byte RXB1SIDLbits = 0xF52
#byte RXB1SIDL = 0xF52

typedef struct 
 {
   unsigned int SID3:7;
   unsigned int SID10:1;
} RXB1SIDHBITS;
RXB1SIDHBITS RXB1SIDHbits;
#byte RXB1SIDHbits = 0xF51
#byte RXB1SIDH = 0xF51

typedef struct 
 {
   union {
      struct {
         unsigned int :3;
         unsigned int FILHIT3:1;
         unsigned int :1;
         unsigned int RTRRO:1;
      };

   union {
      struct {
         unsigned int FILHIT0:3;
         unsigned int RXRTRRO_FILHIT3:1;
         unsigned int FILHIT4:1;
         unsigned int RXM0_RTRRO:1;
         unsigned int RXM1:1;
         unsigned int RXFUL:1;
      };
   };
      struct {
         unsigned int FILHIT:3;
      };

      struct {
         unsigned int :3;
         unsigned int RXRTRRO:1;
         unsigned int :1;
         unsigned int RXM0:1;
      };
   };
} RXB1CONBITS;
RXB1CONBITS RXB1CONbits;
#byte RXB1CONbits = 0xF50
#byte RXB1CON = 0xF50

typedef union 
 {
   union {
      struct {
         unsigned int :1;
         unsigned int WIN0:3;
      };
      struct {
         unsigned int :1;
         unsigned int WIN:3;
      };

      struct {
         unsigned int FP0:1;
         unsigned int WIN0_FP1:1;
         unsigned int WIN1_FP2:1;
         unsigned int WIN2_FP3:1;
         unsigned int ABAT:1;
         unsigned int REQOP0:3;
      };
   };
      struct {
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int REQOP:3;
      };
} CANCON_RO1BITS;
CANCON_RO1BITS CANCON_RO1bits;
#byte CANCON_RO1bits = 0xF4F
#byte CANCON_RO1 = 0xF4F

typedef union 
 {
      struct {
         unsigned int EICODE0:1;
         unsigned int EICODE1_ICODE0:1;
         unsigned int EICODE2_ICODE1:1;
         unsigned int EICODE3_ICODE2:1;
         unsigned int EICODE4:1;
         unsigned int OPMODE0:3;
      };
      struct {
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int OPMODE:3;
      };
} CANSTAT_RO1BITS;
CANSTAT_RO1BITS CANSTAT_RO1bits;
#byte CANSTAT_RO1bits = 0xF4E
#byte CANSTAT_RO1 = 0xF4E

#byte TXB0D7 = 0xF4D

#byte TXB0D6 = 0xF4C

#byte TXB0D5 = 0xF4B

#byte TXB0D4 = 0xF4A

#byte TXB0D3 = 0xF49

#byte TXB0D2 = 0xF48

#byte TXB0D1 = 0xF47

#byte TXB0D0 = 0xF46

typedef union 
 {
      struct {
         unsigned int DLC0:4;
         unsigned int :2;
         unsigned int TXRTR:1;
      };
      struct {
         unsigned int DLC:4;
         unsigned int :2;
      };
} TXB0DLCBITS;
TXB0DLCBITS TXB0DLCbits;
#byte TXB0DLCbits = 0xF45
#byte TXB0DLC = 0xF45

#byte TXB0EIDL = 0xF44

typedef struct 
 {
   unsigned int EID8:2;
   unsigned int EID10:6;
} TXB0EIDHBITS;
TXB0EIDHBITS TXB0EIDHbits;
#byte TXB0EIDHbits = 0xF43
#byte TXB0EIDH = 0xF43

typedef union 
 {
      struct {
         unsigned int EID16:2;
         unsigned int :1;
         unsigned int EXIDE:1;
         unsigned int :1;
         unsigned int SID0:3;
      };
      struct {
         unsigned int EID1:2;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int SID:3;
      };
} TXB0SIDLBITS;
TXB0SIDLBITS TXB0SIDLbits;
#byte TXB0SIDLbits = 0xF42
#byte TXB0SIDL = 0xF42

typedef struct 
 {
   unsigned int SID3:7;
   unsigned int SID10:1;
} TXB0SIDHBITS;
TXB0SIDHBITS TXB0SIDHbits;
#byte TXB0SIDHbits = 0xF41
#byte TXB0SIDH = 0xF41

typedef union 
 {
      struct {
         unsigned int TXPRI0:2;
         unsigned int :1;
         unsigned int TXREQ:1;
         unsigned int TXERR:1;
         unsigned int TXLARB:1;
         unsigned int TXABT:1;
         unsigned int TXBIF:1;
      };
      struct {
         unsigned int TXPRI:2;
      };
} TXB0CONBITS;
TXB0CONBITS TXB0CONbits;
#byte TXB0CONbits = 0xF40
#byte TXB0CON = 0xF40

typedef union 
 {
   union {
      struct {
         unsigned int FP0:1;
         unsigned int WIN0_FP1:1;
         unsigned int WIN1_FP2:1;
         unsigned int WIN2_FP3:1;
         unsigned int ABAT:1;
         unsigned int REQOP0:3;
      };
      struct {
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int REQOP:3;
      };

