ammarRajabA/ENC28J60-LAN/CCS_5 C code/TCPIP/PIC18F4585_registers.h
      struct {
         unsigned int :1;
         unsigned int WIN0:3;
      };
   };
      struct {
         unsigned int :1;
         unsigned int WIN:3;
      };
} CANCON_RO2BITS;
CANCON_RO2BITS CANCON_RO2bits;
#byte CANCON_RO2bits = 0xF3F
#byte CANCON_RO2 = 0xF3F

typedef union 
 {
      struct {
         unsigned int EICODE0:1;
         unsigned int EICODE1_ICODE0:1;
         unsigned int EICODE2_ICODE1:1;
         unsigned int EICODE3_ICODE2:1;
         unsigned int EICODE4:1;
         unsigned int OPMODE0:3;
      };
      struct {
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int OPMODE:3;
      };
} CANSTAT_RO2BITS;
CANSTAT_RO2BITS CANSTAT_RO2bits;
#byte CANSTAT_RO2bits = 0xF3E
#byte CANSTAT_RO2 = 0xF3E

#byte TXB1D7 = 0xF3D

#byte TXB1D6 = 0xF3C

#byte TXB1D5 = 0xF3B

#byte TXB1D4 = 0xF3A

#byte TXB1D3 = 0xF39

#byte TXB1D2 = 0xF38

#byte TXB1D1 = 0xF37

#byte TXB1D0 = 0xF36

typedef union 
 {
      struct {
         unsigned int DLC0:4;
         unsigned int :2;
         unsigned int TXRTR:1;
      };
      struct {
         unsigned int DLC:4;
         unsigned int :2;
      };
} TXB1DLCBITS;
TXB1DLCBITS TXB1DLCbits;
#byte TXB1DLCbits = 0xF35
#byte TXB1DLC = 0xF35

#byte TXB1EIDL = 0xF34

typedef struct 
 {
   unsigned int EID8:2;
   unsigned int EID10:6;
} TXB1EIDHBITS;
TXB1EIDHBITS TXB1EIDHbits;
#byte TXB1EIDHbits = 0xF33
#byte TXB1EIDH = 0xF33

typedef union 
 {
      struct {
         unsigned int EID16:2;
         unsigned int :1;
         unsigned int EXIDE:1;
         unsigned int :1;
         unsigned int SID0:3;
      };
      struct {
         unsigned int EID1:2;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int SID:3;
      };
} TXB1SIDLBITS;
TXB1SIDLBITS TXB1SIDLbits;
#byte TXB1SIDLbits = 0xF32
#byte TXB1SIDL = 0xF32

typedef struct 
 {
   unsigned int SID3:7;
   unsigned int SID10:1;
} TXB1SIDHBITS;
TXB1SIDHBITS TXB1SIDHbits;
#byte TXB1SIDHbits = 0xF31
#byte TXB1SIDH = 0xF31

typedef union 
 {
   union {
      struct {
         unsigned int TXPRI0:2;
         unsigned int :1;
         unsigned int TXREQ:1;
         unsigned int TXERR:1;
         unsigned int TXLARB:1;
         unsigned int TXABT:1;
         unsigned int TXBIF:1;
      };
      struct {
         unsigned int TXPRI:2;
      };

      struct {
         unsigned int :7;
         unsigned int TXBIFTXB1CON:1;
      };
   };
} TXB1CONBITS;
TXB1CONBITS TXB1CONbits;
#byte TXB1CONbits = 0xF30
#byte TXB1CON = 0xF30

typedef union 
 {
   union {
      struct {
         unsigned int :1;
         unsigned int WIN0:3;
      };
      struct {
         unsigned int :1;
         unsigned int WIN:3;
      };

      struct {
         unsigned int FP0:1;
         unsigned int WIN0_FP1:1;
         unsigned int WIN1_FP2:1;
         unsigned int WIN2_FP3:1;
         unsigned int ABAT:1;
         unsigned int REQOP0:3;
      };
   };
      struct {
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int REQOP:3;
      };
} CANCON_RO3BITS;
CANCON_RO3BITS CANCON_RO3bits;
#byte CANCON_RO3bits = 0xF2F
#byte CANCON_RO3 = 0xF2F

typedef union 
 {
      struct {
         unsigned int EICODE0:1;
         unsigned int EICODE1_ICODE0:1;
         unsigned int EICODE2_ICODE1:1;
         unsigned int EICODE3_ICODE2:1;
         unsigned int EICODE4:1;
         unsigned int OPMODE0:3;
      };
      struct {
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int OPMODE:3;
      };
} CANSTAT_RO3BITS;
CANSTAT_RO3BITS CANSTAT_RO3bits;
#byte CANSTAT_RO3bits = 0xF2E
#byte CANSTAT_RO3 = 0xF2E

#byte TXB2D7 = 0xF2D

#byte TXB2D6 = 0xF2C

#byte TXB2D5 = 0xF2B

#byte TXB2D4 = 0xF2A

#byte TXB2D3 = 0xF29

#byte TXB2D2 = 0xF28

#byte TXB2D1 = 0xF27

#byte TXB2D0 = 0xF26

typedef union 
 {
      struct {
         unsigned int DLC0:4;
         unsigned int :2;
         unsigned int TXRTR:1;
      };
      struct {
         unsigned int DLC:4;
         unsigned int :2;
      };
} TXB2DLCBITS;
TXB2DLCBITS TXB2DLCbits;
#byte TXB2DLCbits = 0xF25
#byte TXB2DLC = 0xF25

#byte TXB2EIDL = 0xF24

typedef struct 
 {
   unsigned int EID8:2;
   unsigned int EID10:6;
} TXB2EIDHBITS;
TXB2EIDHBITS TXB2EIDHbits;
#byte TXB2EIDHbits = 0xF23
#byte TXB2EIDH = 0xF23

typedef union 
 {
      struct {
         unsigned int EID16:2;
         unsigned int :1;
         unsigned int EXIDE:1;
         unsigned int :1;
         unsigned int SID0:3;
      };
      struct {
         unsigned int EID1:2;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int SID:3;
      };
} TXB2SIDLBITS;
TXB2SIDLBITS TXB2SIDLbits;
#byte TXB2SIDLbits = 0xF22
#byte TXB2SIDL = 0xF22

typedef struct 
 {
   unsigned int SID3:7;
   unsigned int SID10:1;
} TXB2SIDHBITS;
TXB2SIDHBITS TXB2SIDHbits;
#byte TXB2SIDHbits = 0xF21
#byte TXB2SIDH = 0xF21

typedef struct 
 {
   union {
      struct {
         unsigned int :7;
         unsigned int TXBIFBXB2CON:1;
      };

      struct {
         unsigned int TXPRI0:2;
         unsigned int :1;
         unsigned int TXREQ:1;
         unsigned int TXERR:1;
         unsigned int TXLARB:1;
         unsigned int TXABT:1;
         unsigned int TXBIF:1;
      };
   };
      struct {
         unsigned int TXPRI:2;
      };
} TXB2CONBITS;
TXB2CONBITS TXB2CONbits;
#byte TXB2CONbits = 0xF20
#byte TXB2CON = 0xF20

#byte RXM1EIDL = 0xF1F

typedef struct 
 {
   unsigned int EID8:2;
   unsigned int EID10:6;
} RXM1EIDHBITS;
RXM1EIDHBITS RXM1EIDHbits;
#byte RXM1EIDHbits = 0xF1E
#byte RXM1EIDH = 0xF1E

typedef union 
 {
      struct {
         unsigned int EID16:2;
         unsigned int :1;
         unsigned int EXIDEN:1;
         unsigned int :1;
         unsigned int SID0:3;
      };
      struct {
         unsigned int EID1:2;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int SID:3;
      };
} RXM1SIDLBITS;
RXM1SIDLBITS RXM1SIDLbits;
#byte RXM1SIDLbits = 0xF1D
#byte RXM1SIDL = 0xF1D

typedef struct 
 {
   unsigned int SID3:7;
   unsigned int SID10:1;
} RXM1SIDHBITS;
RXM1SIDHBITS RXM1SIDHbits;
#byte RXM1SIDHbits = 0xF1C
#byte RXM1SIDH = 0xF1C

#byte RXM0EIDL = 0xF1B

typedef struct 
 {
   unsigned int EID8:2;
   unsigned int EID10:6;
} RXM0EIDHBITS;
RXM0EIDHBITS RXM0EIDHbits;
#byte RXM0EIDHbits = 0xF1A
#byte RXM0EIDH = 0xF1A

typedef union 
 {
      struct {
         unsigned int EID16:2;
         unsigned int :1;
         unsigned int EXIDEN:1;
         unsigned int :1;
         unsigned int SID0:3;
      };
      struct {
         unsigned int EID1:2;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int SID:3;
      };
} RXM0SIDLBITS;
RXM0SIDLBITS RXM0SIDLbits;
#byte RXM0SIDLbits = 0xF19
#byte RXM0SIDL = 0xF19

typedef struct 
 {
   unsigned int SID3:7;
   unsigned int SID10:1;
} RXM0SIDHBITS;
RXM0SIDHBITS RXM0SIDHbits;
#byte RXM0SIDHbits = 0xF18
#byte RXM0SIDH = 0xF18

