ammarRajabA/ENC28J60-LAN/CCS_5 C code/TCPIP/PIC18F4585_registers.h
#byte RXF5EIDL = 0xF17

typedef struct 
 {
   unsigned int EID8:2;
   unsigned int EID10:6;
} RXF5EIDHBITS;
RXF5EIDHBITS RXF5EIDHbits;
#byte RXF5EIDHbits = 0xF16
#byte RXF5EIDH = 0xF16

typedef union 
 {
   union {
      struct {
         unsigned int EID16:2;
         unsigned int :1;
         unsigned int EXIDEN:1;
         unsigned int :1;
         unsigned int SID0:3;
      };
      struct {
         unsigned int EID1:2;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int SID:3;
      };

      struct {
         unsigned int :3;
         unsigned int EXIDE:1;
      };
   };
} RXF5SIDLBITS;
RXF5SIDLBITS RXF5SIDLbits;
#byte RXF5SIDLbits = 0xF15
#byte RXF5SIDL = 0xF15

typedef struct 
 {
   unsigned int SID3:7;
   unsigned int SID10:1;
} RXF5SIDHBITS;
RXF5SIDHBITS RXF5SIDHbits;
#byte RXF5SIDHbits = 0xF14
#byte RXF5SIDH = 0xF14

#byte RXF4EIDL = 0xF13

typedef struct 
 {
   unsigned int EID8:2;
   unsigned int EID10:6;
} RXF4EIDHBITS;
RXF4EIDHBITS RXF4EIDHbits;
#byte RXF4EIDHbits = 0xF12
#byte RXF4EIDH = 0xF12

typedef union 
 {
   union {
      struct {
         unsigned int EID16:2;
         unsigned int :1;
         unsigned int EXIDEN:1;
         unsigned int :1;
         unsigned int SID0:3;
      };
      struct {
         unsigned int EID1:2;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int SID:3;
      };

      struct {
         unsigned int :3;
         unsigned int EXIDE:1;
      };
   };
} RXF4SIDLBITS;
RXF4SIDLBITS RXF4SIDLbits;
#byte RXF4SIDLbits = 0xF11
#byte RXF4SIDL = 0xF11

typedef struct 
 {
   unsigned int SID3:7;
   unsigned int SID10:1;
} RXF4SIDHBITS;
RXF4SIDHBITS RXF4SIDHbits;
#byte RXF4SIDHbits = 0xF10
#byte RXF4SIDH = 0xF10

#byte RXF3EIDL = 0xF0F

typedef struct 
 {
   unsigned int EID8:2;
   unsigned int EID10:6;
} RXF3EIDHBITS;
RXF3EIDHBITS RXF3EIDHbits;
#byte RXF3EIDHbits = 0xF0E
#byte RXF3EIDH = 0xF0E

typedef struct 
 {
   union {
      struct {
         unsigned int :3;
         unsigned int EXIDE:1;
      };

      struct {
         unsigned int EID16:2;
         unsigned int :1;
         unsigned int EXIDEN:1;
         unsigned int :1;
         unsigned int SID0:3;
      };
   };
      struct {
         unsigned int EID1:2;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int SID:3;
      };
} RXF3SIDLBITS;
RXF3SIDLBITS RXF3SIDLbits;
#byte RXF3SIDLbits = 0xF0D
#byte RXF3SIDL = 0xF0D

typedef struct 
 {
   unsigned int SID3:7;
   unsigned int SID10:1;
} RXF3SIDHBITS;
RXF3SIDHBITS RXF3SIDHbits;
#byte RXF3SIDHbits = 0xF0C
#byte RXF3SIDH = 0xF0C

#byte RXF2EIDL = 0xF0B

typedef struct 
 {
   unsigned int EID8:2;
   unsigned int EID10:6;
} RXF2EIDHBITS;
RXF2EIDHBITS RXF2EIDHbits;
#byte RXF2EIDHbits = 0xF0A
#byte RXF2EIDH = 0xF0A

typedef union 
 {
   union {
      struct {
         unsigned int EID16:2;
         unsigned int :1;
         unsigned int EXIDEN:1;
         unsigned int :1;
         unsigned int SID0:3;
      };
      struct {
         unsigned int EID1:2;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int SID:3;
      };

      struct {
         unsigned int :3;
         unsigned int EXIDE:1;
      };
   };
} RXF2SIDLBITS;
RXF2SIDLBITS RXF2SIDLbits;
#byte RXF2SIDLbits = 0xF09
#byte RXF2SIDL = 0xF09

typedef struct 
 {
   unsigned int SID3:7;
   unsigned int SID10:1;
} RXF2SIDHBITS;
RXF2SIDHBITS RXF2SIDHbits;
#byte RXF2SIDHbits = 0xF08
#byte RXF2SIDH = 0xF08

#byte RXF1EIDL = 0xF07

typedef struct 
 {
   unsigned int EID8:2;
   unsigned int EID10:6;
} RXF1EIDHBITS;
RXF1EIDHBITS RXF1EIDHbits;
#byte RXF1EIDHbits = 0xF06
#byte RXF1EIDH = 0xF06

typedef struct 
 {
   union {
      struct {
         unsigned int :3;
         unsigned int EXIDE:1;
      };

      struct {
         unsigned int EID16:2;
         unsigned int :1;
         unsigned int EXIDEN:1;
         unsigned int :1;
         unsigned int SID0:3;
      };
   };
      struct {
         unsigned int EID1:2;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int SID:3;
      };
} RXF1SIDLBITS;
RXF1SIDLBITS RXF1SIDLbits;
#byte RXF1SIDLbits = 0xF05
#byte RXF1SIDL = 0xF05

typedef struct 
 {
   unsigned int SID3:7;
   unsigned int SID10:1;
} RXF1SIDHBITS;
RXF1SIDHBITS RXF1SIDHbits;
#byte RXF1SIDHbits = 0xF04
#byte RXF1SIDH = 0xF04

#byte RXF0EIDL = 0xF03

typedef struct 
 {
   unsigned int EID8:2;
   unsigned int EID10:6;
} RXF0EIDHBITS;
RXF0EIDHBITS RXF0EIDHbits;
#byte RXF0EIDHbits = 0xF02
#byte RXF0EIDH = 0xF02

typedef union 
 {
   union {
      struct {
         unsigned int EID16:2;
         unsigned int :1;
         unsigned int EXIDEN:1;
         unsigned int :1;
         unsigned int SID0:3;
      };
      struct {
         unsigned int EID1:2;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int SID:3;
      };

      struct {
         unsigned int :3;
         unsigned int EXIDE:1;
      };
   };
} RXF0SIDLBITS;
RXF0SIDLBITS RXF0SIDLbits;
#byte RXF0SIDLbits = 0xF01
#byte RXF0SIDL = 0xF01

typedef struct 
 {
   unsigned int SID3:7;
   unsigned int SID10:1;
} RXF0SIDHBITS;
RXF0SIDHBITS RXF0SIDHbits;
#byte RXF0SIDHbits = 0xF00
#byte RXF0SIDH = 0xF00

typedef union 
 {
   union {
      struct {
         unsigned int FP0:1;
         unsigned int WIN0_FP1:1;
         unsigned int WIN1_FP2:1;
         unsigned int WIN2_FP3:1;
         unsigned int ABAT:1;
         unsigned int REQOP0:3;
      };
      struct {
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int REQOP:3;
      };

