ammarRajabA/ENC28J60-LAN/CCS_5 C code/TCPIP/PIC18F4585_registers.h
      struct {
         unsigned int :1;
         unsigned int WIN0:3;
      };
   };
      struct {
         unsigned int :1;
         unsigned int WIN:3;
      };
} CANCON_RO4BITS;
CANCON_RO4BITS CANCON_RO4bits;
#byte CANCON_RO4bits = 0xE7F
#byte CANCON_RO4 = 0xE7F

typedef union 
 {
      struct {
         unsigned int EICODE0:1;
         unsigned int EICODE1_ICODE0:1;
         unsigned int EICODE2_ICODE1:1;
         unsigned int EICODE3_ICODE2:1;
         unsigned int EICODE4:1;
         unsigned int OPMODE0:3;
      };
      struct {
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int OPMODE:3;
      };
} CANSTAT_RO4BITS;
CANSTAT_RO4BITS CANSTAT_RO4bits;
#byte CANSTAT_RO4bits = 0xE7E
#byte CANSTAT_RO4 = 0xE7E

#byte B5D7 = 0xE7D

#byte B5D6 = 0xE7C

#byte B5D5 = 0xE7B

#byte B5D4 = 0xE7A

#byte B5D3 = 0xE79

#byte B5D2 = 0xE78

typedef struct 
 {
   unsigned int :3;
   unsigned int B57D23:1;
} B5D2BITS;
B5D2BITS B5D2bits;
#byte B5D2bits = 0xE78
#byte B5D2 = 0xE78

#byte B5D1 = 0xE77

#byte B5D0 = 0xE76

typedef struct 
 {
   unsigned int :7;
   unsigned int B57D07:1;
} B5D0BITS;
B5D0BITS B5D0bits;
#byte B5D0bits = 0xE76
#byte B5D0 = 0xE76

typedef union 
 {
   union {
      struct {
         unsigned int :4;
         unsigned int RESRB0:2;
         unsigned int RXRTR:1;
      };
      struct {
         unsigned int :4;
         unsigned int RESRB:2;
      };

      struct {
         unsigned int DLC0:4;
         unsigned int RB0:2;
         unsigned int RXRTR_TXRTR:1;
      };
   };
      struct {
         unsigned int DLC:4;
         unsigned int RB:2;
      };
} B5DLCBITS;
B5DLCBITS B5DLCbits;
#byte B5DLCbits = 0xE75
#byte B5DLC = 0xE75

#byte B5EIDL = 0xE74

typedef struct 
 {
   unsigned int EID8:2;
   unsigned int EID10:6;
} B5EIDHBITS;
B5EIDHBITS B5EIDHbits;
#byte B5EIDHbits = 0xE73
#byte B5EIDH = 0xE73

typedef struct 
 {
   union {
      struct {
         unsigned int :3;
         unsigned int EXIDEN:1;
      };

   union {
      struct {
         unsigned int EID16:2;
         unsigned int :1;
         unsigned int EXIDE:1;
         unsigned int SRR:1;
         unsigned int SID0:3;
      };
   };
      struct {
         unsigned int EID1:2;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int SID:3;
      };

      struct {
         unsigned int :3;
         unsigned int EXID:1;
      };
   };
} B5SIDLBITS;
B5SIDLBITS B5SIDLbits;
#byte B5SIDLbits = 0xE72
#byte B5SIDL = 0xE72

typedef struct 
 {
   unsigned int SID3:7;
   unsigned int SID10:1;
} B5SIDHBITS;
B5SIDHBITS B5SIDHbits;
#byte B5SIDHbits = 0xE71
#byte B5SIDH = 0xE71

typedef struct 
 {
   union {
      struct {
         unsigned int :5;
         unsigned int RXRTRRO:1;
      };

   union {
      struct {
         unsigned int TXPRI0:2;
         unsigned int RTREN:1;
         unsigned int TXREQ:1;
         unsigned int TXERR:1;
         unsigned int TXLARB:1;
         unsigned int TXABT:1;
         unsigned int TXBIF:1;
      };
   };
      struct {
         unsigned int TXPRI:2;
      };

   union {
      struct {
         unsigned int FILHIT0:5;
         unsigned int RTRRO:1;
         unsigned int RXM1:1;
         unsigned int RXFUL:1;
      };
   };
      struct {
         unsigned int FILHIT:5;
      };

      struct {
         unsigned int FILHIT0_TXPRI0:1;
         unsigned int FILHIT1_TXPRI1:1;
         unsigned int FILHIT2_RTREN:1;
         unsigned int FILHIT3_TXREQ:1;
         unsigned int FILHIT4_TXERR:1;
         unsigned int RXRTRRO_TXLARB:1;
         unsigned int RXM1_TXABT:1;
         unsigned int RXFUL_TXBIF:1;
      };
   };
} B5CONBITS;
B5CONBITS B5CONbits;
#byte B5CONbits = 0xE70
#byte B5CON = 0xE70

typedef union 
 {
   union {
      struct {
         unsigned int FP0:1;
         unsigned int WIN0_FP1:1;
         unsigned int WIN1_FP2:1;
         unsigned int WIN2_FP3:1;
         unsigned int ABAT:1;
         unsigned int REQOP0:3;
      };
      struct {
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int REQOP:3;
      };

      struct {
         unsigned int :1;
         unsigned int WIN0:3;
      };
   };
      struct {
         unsigned int :1;
         unsigned int WIN:3;
      };
} CANCON_RO5BITS;
CANCON_RO5BITS CANCON_RO5bits;
#byte CANCON_RO5bits = 0xE6F
#byte CANCON_RO5 = 0xE6F

typedef union 
 {
      struct {
         unsigned int EICODE0:1;
         unsigned int EICODE1_ICODE0:1;
         unsigned int EICODE2_ICODE1:1;
         unsigned int EICODE3_ICODE2:1;
         unsigned int EICODE4:1;
         unsigned int OPMODE0:3;
      };
      struct {
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int OPMODE:3;
      };
} CANSTAT_RO5BITS;
CANSTAT_RO5BITS CANSTAT_RO5bits;
#byte CANSTAT_RO5bits = 0xE6E
#byte CANSTAT_RO5 = 0xE6E

#byte B4D7 = 0xE6D

typedef struct 
 {
   unsigned int :7;
   unsigned int B46D77:1;
} B4D7BITS;
B4D7BITS B4D7bits;
#byte B4D7bits = 0xE6D
#byte B4D7 = 0xE6D

#byte B4D6 = 0xE6C

#byte B4D5 = 0xE6B

#byte B4D4 = 0xE6A

#byte B4D3 = 0xE69

#byte B4D2 = 0xE68

#byte B4D1 = 0xE67

#byte B4D0 = 0xE66

typedef struct 
 {
   union {
      struct {
         unsigned int :6;
         unsigned int RXRTR:1;
      };

   union {
      struct {
         unsigned int :4;
         unsigned int RESRB0:2;
         unsigned int TXRTR:1;
      };
   };
      struct {
         unsigned int :4;
         unsigned int RESRB:2;
      };

      struct {
         unsigned int DLC0:4;
         unsigned int RB0:2;
         unsigned int RXRTR_TXRTR:1;
      };
   };
      struct {
         unsigned int DLC:4;
         unsigned int RB:2;
      };
} B4DLCBITS;
B4DLCBITS B4DLCbits;
#byte B4DLCbits = 0xE65
#byte B4DLC = 0xE65

#byte B4EIDL = 0xE64

typedef struct 
 {
   unsigned int EID8:2;
   unsigned int EID10:6;
} B4EIDHBITS;
B4EIDHBITS B4EIDHbits;
#byte B4EIDHbits = 0xE63
#byte B4EIDH = 0xE63

typedef union 
 {
   union {
      struct {
         unsigned int EID16:2;
         unsigned int :1;
         unsigned int EXIDE:1;
         unsigned int SRR:1;
         unsigned int SID0:3;
      };
      struct {
         unsigned int EID1:2;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int SID:3;
      };

