ammarRajabA/ENC28J60-LAN/CCS_5 C code/TCPIP/PIC18F4585_registers.h
      struct {
         unsigned int :3;
         unsigned int EXID:1;
      };
   };
} B4SIDLBITS;
B4SIDLBITS B4SIDLbits;
#byte B4SIDLbits = 0xE62
#byte B4SIDL = 0xE62

typedef struct 
 {
   unsigned int SID3:7;
   unsigned int SID10:1;
} B4SIDHBITS;
B4SIDHBITS B4SIDHbits;
#byte B4SIDHbits = 0xE61
#byte B4SIDH = 0xE61

typedef struct 
 {
   union {
      struct {
         unsigned int :5;
         unsigned int RXRTRRO:1;
      };

   union {
      struct {
         unsigned int FILHIT0_TXPRI0:1;
         unsigned int FILHIT1_TXPRI1:1;
         unsigned int FILHIT2_RTREN:1;
         unsigned int FILHIT3_TXREQ:1;
         unsigned int FILHIT4_TXERR:1;
         unsigned int RXRTRRO_TXLARB:1;
         unsigned int RXM1_TXABT:1;
         unsigned int RXFUL_TXBIF:1;
      };
   };

   union {
      struct {
         unsigned int FILHIT0:5;
         unsigned int RTRRO:1;
         unsigned int RXM1:1;
         unsigned int RXFUL:1;
      };
   };
      struct {
         unsigned int FILHIT:5;
      };

      struct {
         unsigned int TXPRI0:2;
         unsigned int RTREN:1;
         unsigned int TXREQ:1;
         unsigned int TXERR:1;
         unsigned int TXLARB:1;
         unsigned int TXABT:1;
         unsigned int TXBIF:1;
      };
   };
      struct {
         unsigned int TXPRI:2;
      };
} B4CONBITS;
B4CONBITS B4CONbits;
#byte B4CONbits = 0xE60
#byte B4CON = 0xE60

typedef union 
 {
   union {
      struct {
         unsigned int FP0:1;
         unsigned int WIN0_FP1:1;
         unsigned int WIN1_FP2:1;
         unsigned int WIN2_FP3:1;
         unsigned int ABAT:1;
         unsigned int REQOP0:3;
      };
      struct {
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int REQOP:3;
      };

      struct {
         unsigned int :1;
         unsigned int WIN0:3;
      };
   };
      struct {
         unsigned int :1;
         unsigned int WIN:3;
      };
} CANCON_RO6BITS;
CANCON_RO6BITS CANCON_RO6bits;
#byte CANCON_RO6bits = 0xE5F
#byte CANCON_RO6 = 0xE5F

typedef union 
 {
      struct {
         unsigned int EICODE0:1;
         unsigned int EICODE1_ICODE0:1;
         unsigned int EICODE2_ICODE1:1;
         unsigned int EICODE3_ICODE2:1;
         unsigned int EICODE4:1;
         unsigned int OPMODE0:3;
      };
      struct {
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int OPMODE:3;
      };
} CANSTAT_RO6BITS;
CANSTAT_RO6BITS CANSTAT_RO6bits;
#byte CANSTAT_RO6bits = 0xE5E
#byte CANSTAT_RO6 = 0xE5E

#byte B3D7 = 0xE5D

#byte B3D6 = 0xE5C

#byte B3D5 = 0xE5B

#byte B3D4 = 0xE5A

#byte B3D3 = 0xE59

#byte B3D2 = 0xE58

#byte B3D1 = 0xE57

#byte B3D0 = 0xE56

typedef struct 
 {
   union {
      struct {
         unsigned int :6;
         unsigned int RXRTR:1;
      };

   union {
      struct {
         unsigned int :4;
         unsigned int RESRB0:2;
         unsigned int TXRTR:1;
      };
   };
      struct {
         unsigned int :4;
         unsigned int RESRB:2;
      };

      struct {
         unsigned int DLC0:4;
         unsigned int RB0:2;
         unsigned int RXRTR_TXRTR:1;
      };
   };
      struct {
         unsigned int DLC:4;
         unsigned int RB:2;
      };
} B3DLCBITS;
B3DLCBITS B3DLCbits;
#byte B3DLCbits = 0xE55
#byte B3DLC = 0xE55

#byte B3EIDL = 0xE54

typedef struct 
 {
   unsigned int EID8:2;
   unsigned int EID10:6;
} B3EIDHBITS;
B3EIDHBITS B3EIDHbits;
#byte B3EIDHbits = 0xE53
#byte B3EIDH = 0xE53

typedef union 
 {
   union {
      struct {
         unsigned int EID16:2;
         unsigned int :1;
         unsigned int EXIDE:1;
         unsigned int SRR:1;
         unsigned int SID0:3;
      };
      struct {
         unsigned int EID1:2;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int SID:3;
      };

      struct {
         unsigned int :3;
         unsigned int EXID:1;
      };
   };
} B3SIDLBITS;
B3SIDLBITS B3SIDLbits;
#byte B3SIDLbits = 0xE52
#byte B3SIDL = 0xE52

typedef struct 
 {
   unsigned int SID3:7;
   unsigned int SID10:1;
} B3SIDHBITS;
B3SIDHBITS B3SIDHbits;
#byte B3SIDHbits = 0xE51
#byte B3SIDH = 0xE51

typedef struct 
 {
   union {
      struct {
         unsigned int :5;
         unsigned int RXRTRRO:1;
      };

   union {
      struct {
         unsigned int TXPRI0:2;
         unsigned int RTREN:1;
         unsigned int TXREQ:1;
         unsigned int TXERR:1;
         unsigned int TXLARB:1;
         unsigned int TXABT:1;
         unsigned int TXBIF:1;
      };
   };
      struct {
         unsigned int TXPRI:2;
      };

   union {
      struct {
         unsigned int FILHIT0_TXPRI0:1;
         unsigned int FILHIT1_TXPRI1:1;
         unsigned int FILHIT2_RTREN:1;
         unsigned int FILHIT3_TXREQ:1;
         unsigned int FILHIT4_TXERR:1;
         unsigned int RXRTRRO_TXLARB:1;
         unsigned int RXM1_TXABT:1;
         unsigned int RXFUL_TXBIF:1;
      };
   };

      struct {
         unsigned int FILHIT0:5;
         unsigned int RTRRO:1;
         unsigned int RXM1:1;
         unsigned int RXFUL:1;
      };
   };
      struct {
         unsigned int FILHIT:5;
      };
} B3CONBITS;
B3CONBITS B3CONbits;
#byte B3CONbits = 0xE50
#byte B3CON = 0xE50

typedef union 
 {
   union {
      struct {
         unsigned int :1;
         unsigned int WIN0:3;
      };
      struct {
         unsigned int :1;
         unsigned int WIN:3;
      };

      struct {
         unsigned int FP0:1;
         unsigned int WIN0_FP1:1;
         unsigned int WIN1_FP2:1;
         unsigned int WIN2_FP3:1;
         unsigned int ABAT:1;
         unsigned int REQOP0:3;
      };
   };
      struct {
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int REQOP:3;
      };
} CANCON_RO7BITS;
CANCON_RO7BITS CANCON_RO7bits;
#byte CANCON_RO7bits = 0xE4F
#byte CANCON_RO7 = 0xE4F

typedef union 
 {
      struct {
         unsigned int EICODE0:1;
         unsigned int EICODE1_ICODE0:1;
         unsigned int EICODE2_ICODE1:1;
         unsigned int EICODE3_ICODE2:1;
         unsigned int EICODE4:1;
         unsigned int OPMODE0:3;
      };
      struct {
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int OPMODE:3;
      };
} CANSTAT_RO7BITS;
