ammarRajabA/ENC28J60-LAN/CCS_5 C code/TCPIP/PIC18F4585_registers.h
CANSTAT_RO7BITS CANSTAT_RO7bits;
#byte CANSTAT_RO7bits = 0xE4E
#byte CANSTAT_RO7 = 0xE4E

#byte B2D7 = 0xE4D

#byte B2D6 = 0xE4C

#byte B2D5 = 0xE4B

#byte B2D4 = 0xE4A

#byte B2D3 = 0xE49

#byte B2D2 = 0xE48

#byte B2D1 = 0xE47

#byte B2D0 = 0xE46

typedef struct 
 {
   union {
      struct {
         unsigned int :6;
         unsigned int RXRTR:1;
      };

   union {
      struct {
         unsigned int :4;
         unsigned int RESRB0:2;
         unsigned int TXRTR:1;
      };
   };
      struct {
         unsigned int :4;
         unsigned int RESRB:2;
      };

      struct {
         unsigned int DLC0:4;
         unsigned int RB0:2;
         unsigned int RXRTR_TXRTR:1;
      };
   };
      struct {
         unsigned int DLC:4;
         unsigned int RB:2;
      };
} B2DLCBITS;
B2DLCBITS B2DLCbits;
#byte B2DLCbits = 0xE45
#byte B2DLC = 0xE45

#byte B2EIDL = 0xE44

typedef struct 
 {
   unsigned int EID8:2;
   unsigned int EID10:6;
} B2EIDHBITS;
B2EIDHBITS B2EIDHbits;
#byte B2EIDHbits = 0xE43
#byte B2EIDH = 0xE43

typedef struct 
 {
   union {
      struct {
         unsigned int :3;
         unsigned int EXID:1;
      };

      struct {
         unsigned int EID16:2;
         unsigned int :1;
         unsigned int EXIDE:1;
         unsigned int SRR:1;
         unsigned int SID0:3;
      };
   };
      struct {
         unsigned int EID1:2;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int SID:3;
      };
} B2SIDLBITS;
B2SIDLBITS B2SIDLbits;
#byte B2SIDLbits = 0xE42
#byte B2SIDL = 0xE42

typedef struct 
 {
   unsigned int SID3:7;
   unsigned int SID10:1;
} B2SIDHBITS;
B2SIDHBITS B2SIDHbits;
#byte B2SIDHbits = 0xE41
#byte B2SIDH = 0xE41

typedef struct 
 {
   union {
      struct {
         unsigned int :5;
         unsigned int RXRTRRO:1;
      };

   union {
      struct {
         unsigned int TXPRI0:2;
         unsigned int RTREN:1;
         unsigned int TXREQ:1;
         unsigned int TXERR:1;
         unsigned int TXLARB:1;
         unsigned int TXABT:1;
         unsigned int TXBIF:1;
      };
   };
      struct {
         unsigned int TXPRI:2;
      };

   union {
      struct {
         unsigned int FILHIT0_TXPRI0:1;
         unsigned int FILHIT1_TXPRI1:1;
         unsigned int FILHIT2_RTREN:1;
         unsigned int FILHIT3_TXREQ:1;
         unsigned int FILHIT4_TXERR:1;
         unsigned int RXRTRRO_TXLARB:1;
         unsigned int RXM1_TXABT:1;
         unsigned int RXFUL_TXBIF:1;
      };
   };

      struct {
         unsigned int FILHIT0:5;
         unsigned int RTRRO:1;
         unsigned int RXM1:1;
         unsigned int RXFUL:1;
      };
   };
      struct {
         unsigned int FILHIT:5;
      };
} B2CONBITS;
B2CONBITS B2CONbits;
#byte B2CONbits = 0xE40
#byte B2CON = 0xE40

typedef union 
 {
   union {
      struct {
         unsigned int :1;
         unsigned int WIN0:3;
      };
      struct {
         unsigned int :1;
         unsigned int WIN:3;
      };

      struct {
         unsigned int FP0:1;
         unsigned int WIN0_FP1:1;
         unsigned int WIN1_FP2:1;
         unsigned int WIN2_FP3:1;
         unsigned int ABAT:1;
         unsigned int REQOP0:3;
      };
   };
      struct {
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int REQOP:3;
      };
} CANCON_RO8BITS;
CANCON_RO8BITS CANCON_RO8bits;
#byte CANCON_RO8bits = 0xE3F
#byte CANCON_RO8 = 0xE3F

typedef union 
 {
      struct {
         unsigned int EICODE0:1;
         unsigned int EICODE1_ICODE0:1;
         unsigned int EICODE2_ICODE1:1;
         unsigned int EICODE3_ICODE2:1;
         unsigned int EICODE4:1;
         unsigned int OPMODE0:3;
      };
      struct {
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int OPMODE:3;
      };
} CANSTAT_RO8BITS;
CANSTAT_RO8BITS CANSTAT_RO8bits;
#byte CANSTAT_RO8bits = 0xE3E
#byte CANSTAT_RO8 = 0xE3E

#byte B1D7 = 0xE3D

#byte B1D6 = 0xE3C

#byte B1D5 = 0xE3B

#byte B1D4 = 0xE3A

#byte B1D3 = 0xE39

#byte B1D2 = 0xE38

#byte B1D1 = 0xE37

#byte B1D0 = 0xE36

typedef struct 
 {
   union {
      struct {
         unsigned int :6;
         unsigned int RXRTR:1;
      };

   union {
      struct {
         unsigned int :4;
         unsigned int RESRB0:2;
         unsigned int TXRTR:1;
      };
   };
      struct {
         unsigned int :4;
         unsigned int RESRB:2;
      };

      struct {
         unsigned int DLC0:4;
         unsigned int RB0:2;
         unsigned int RXRTR_TXRTR:1;
      };
   };
      struct {
         unsigned int DLC:4;
         unsigned int RB:2;
      };
} B1DLCBITS;
B1DLCBITS B1DLCbits;
#byte B1DLCbits = 0xE35
#byte B1DLC = 0xE35

#byte B1EIDL = 0xE34

typedef struct 
 {
   unsigned int EID8:2;
   unsigned int EID10:6;
} B1EIDHBITS;
B1EIDHBITS B1EIDHbits;
#byte B1EIDHbits = 0xE33
#byte B1EIDH = 0xE33

typedef union 
 {
   union {
      struct {
         unsigned int EID16:2;
         unsigned int :1;
         unsigned int EXIDE:1;
         unsigned int SRR:1;
         unsigned int SID0:3;
      };
      struct {
         unsigned int EID1:2;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int SID:3;
      };

      struct {
         unsigned int :3;
         unsigned int EXID:1;
      };
   };
} B1SIDLBITS;
B1SIDLBITS B1SIDLbits;
#byte B1SIDLbits = 0xE32
#byte B1SIDL = 0xE32

typedef struct 
 {
   unsigned int SID3:7;
   unsigned int SID10:1;
} B1SIDHBITS;
B1SIDHBITS B1SIDHbits;
#byte B1SIDHbits = 0xE31
#byte B1SIDH = 0xE31

typedef struct 
 {
   union {
      struct {
         unsigned int :5;
         unsigned int RXRTRRO:1;
      };

   union {
      struct {
         unsigned int TXPRI0:2;
         unsigned int RTREN:1;
         unsigned int TXREQ:1;
         unsigned int TXERR:1;
         unsigned int TXLARB:1;
         unsigned int TXABT:1;
         unsigned int TXBIF:1;
      };
   };
      struct {
         unsigned int TXPRI:2;
      };

   union {
      struct {
         unsigned int FILHIT0:5;
         unsigned int RTRRO:1;
         unsigned int RXM1:1;
         unsigned int RXFUL:1;
      };
   };
      struct {
         unsigned int FILHIT:5;
      };

