ammarRajabA/ENC28J60-LAN/CCS_5 C code/TCPIP/PIC18F4585_registers.h
      struct {
         unsigned int FILHIT0_TXPRI0:1;
         unsigned int FILHIT1_TXPRI1:1;
         unsigned int FILHIT2_RTREN:1;
         unsigned int FILHIT3_TXREQ:1;
         unsigned int FILHIT4_TXERR:1;
         unsigned int RXRTRRO_TXLARB:1;
         unsigned int RXM1_TXABT:1;
         unsigned int RXFUL_TXBIF:1;
      };
   };
} B1CONBITS;
B1CONBITS B1CONbits;
#byte B1CONbits = 0xE30
#byte B1CON = 0xE30

typedef union 
 {
   union {
      struct {
         unsigned int FP0:1;
         unsigned int WIN0_FP1:1;
         unsigned int WIN1_FP2:1;
         unsigned int WIN2_FP3:1;
         unsigned int ABAT:1;
         unsigned int REQOP0:3;
      };
      struct {
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int REQOP:3;
      };

      struct {
         unsigned int :1;
         unsigned int WIN0:3;
      };
   };
      struct {
         unsigned int :1;
         unsigned int WIN:3;
      };
} CANCON_RO9BITS;
CANCON_RO9BITS CANCON_RO9bits;
#byte CANCON_RO9bits = 0xE2F
#byte CANCON_RO9 = 0xE2F

typedef union 
 {
      struct {
         unsigned int EICODE0:1;
         unsigned int EICODE1_ICODE0:1;
         unsigned int EICODE2_ICODE1:1;
         unsigned int EICODE3_ICODE2:1;
         unsigned int EICODE4:1;
         unsigned int OPMODE0:3;
      };
      struct {
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int OPMODE:3;
      };
} CANSTAT_RO9BITS;
CANSTAT_RO9BITS CANSTAT_RO9bits;
#byte CANSTAT_RO9bits = 0xE2E
#byte CANSTAT_RO9 = 0xE2E

#byte B0D7 = 0xE2D

#byte B0D6 = 0xE2C

#byte B0D5 = 0xE2B

#byte B0D4 = 0xE2A

#byte B0D3 = 0xE29

#byte B0D2 = 0xE28

#byte B0D1 = 0xE27

#byte B0D0 = 0xE26

typedef struct 
 {
   union {
      struct {
         unsigned int :6;
         unsigned int RXRTR:1;
      };

   union {
      struct {
         unsigned int :4;
         unsigned int RESRB0:2;
         unsigned int TXRTR:1;
      };
   };
      struct {
         unsigned int :4;
         unsigned int RESRB:2;
      };

      struct {
         unsigned int DLC0:4;
         unsigned int RB0:2;
         unsigned int RXRTR_TXRTR:1;
      };
   };
      struct {
         unsigned int DLC:4;
         unsigned int RB:2;
      };
} B0DLCBITS;
B0DLCBITS B0DLCbits;
#byte B0DLCbits = 0xE25
#byte B0DLC = 0xE25

#byte B0EIDL = 0xE24

typedef struct 
 {
   unsigned int EID8:2;
   unsigned int EID10:6;
} B0EIDHBITS;
B0EIDHBITS B0EIDHbits;
#byte B0EIDHbits = 0xE23
#byte B0EIDH = 0xE23

typedef struct 
 {
   union {
      struct {
         unsigned int :3;
         unsigned int EXID:1;
      };

      struct {
         unsigned int EID16:2;
         unsigned int :1;
         unsigned int EXIDE:1;
         unsigned int SRR:1;
         unsigned int SID0:3;
      };
   };
      struct {
         unsigned int EID1:2;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int SID:3;
      };
} B0SIDLBITS;
B0SIDLBITS B0SIDLbits;
#byte B0SIDLbits = 0xE22
#byte B0SIDL = 0xE22

typedef struct 
 {
   unsigned int SID3:7;
   unsigned int SID10:1;
} B0SIDHBITS;
B0SIDHBITS B0SIDHbits;
#byte B0SIDHbits = 0xE21
#byte B0SIDH = 0xE21

typedef struct 
 {
   union {
      struct {
         unsigned int :5;
         unsigned int RXRTRRO:1;
      };

   union {
      struct {
         unsigned int TXPRI0:2;
         unsigned int RTREN:1;
         unsigned int TXREQ:1;
         unsigned int TXERR:1;
         unsigned int TXLARB:1;
         unsigned int TXABT:1;
         unsigned int TXBIF:1;
      };
   };
      struct {
         unsigned int TXPRI:2;
      };

   union {
      struct {
         unsigned int FILHIT0_TXPRI0:1;
         unsigned int FILHIT1_TXPRI1:1;
         unsigned int FILHIT2_RTREN:1;
         unsigned int FILHIT3_TXREQ:1;
         unsigned int FILHIT4_TXERR:1;
         unsigned int RXRTRRO_TXLARB:1;
         unsigned int RXM1_TXABT:1;
         unsigned int RXFUL_TXBIF:1;
      };
   };

      struct {
         unsigned int FILHIT0:5;
         unsigned int RTRRO:1;
         unsigned int RXM1:1;
         unsigned int RXFUL:1;
      };
   };
      struct {
         unsigned int FILHIT:5;
      };
} B0CONBITS;
B0CONBITS B0CONbits;
#byte B0CONbits = 0xE20
#byte B0CON = 0xE20

typedef struct 
 {
   unsigned int :2;
   unsigned int TXB0IE:1;
   unsigned int TXB1IE:1;
   unsigned int TXB2IE:1;
} TXBIEBITS;
TXBIEBITS TXBIEbits;
#byte TXBIEbits = 0xDFC
#byte TXBIE = 0xDFC

typedef struct 
 {
   unsigned int RXB0IE:1;
   unsigned int RXB1IE:1;
   unsigned int B0IE:1;
   unsigned int B1IE:1;
   unsigned int B2IE:1;
   unsigned int B3IE:1;
   unsigned int B4IE:1;
   unsigned int B5IE:1;
} BIE0BITS;
BIE0BITS BIE0bits;
#byte BIE0bits = 0xDFA
#byte BIE0 = 0xDFA

typedef struct 
 {
   unsigned int :2;
   unsigned int B0TXEN:1;
   unsigned int B1TXEN:1;
   unsigned int B2TXEN:1;
   unsigned int B3TXEN:1;
   unsigned int B4TXEN:1;
   unsigned int B5TXEN:1;
} BSEL0BITS;
BSEL0BITS BSEL0bits;
#byte BSEL0bits = 0xDF8
#byte BSEL0 = 0xDF8

typedef union 
 {
      struct {
         unsigned int FIL12_0:2;
         unsigned int FIL13_0:2;
         unsigned int FIL14_0:2;
         unsigned int FIL15_0:2;
      };
      struct {
         unsigned int FIL12_:2;
         unsigned int FIL13_:2;
         unsigned int FIL14_:2;
         unsigned int FIL15_:2;
      };
} MSEL3BITS;
MSEL3BITS MSEL3bits;
#byte MSEL3bits = 0xDF3
#byte MSEL3 = 0xDF3

typedef union 
 {
      struct {
         unsigned int FIL8_0:2;
         unsigned int FIL9_0:2;
         unsigned int FIL10_0:2;
         unsigned int FIL11_0:2;
      };
      struct {
         unsigned int FIL8_:2;
         unsigned int FIL9_:2;
         unsigned int FIL10_:2;
         unsigned int FIL11_:2;
      };
} MSEL2BITS;
MSEL2BITS MSEL2bits;
#byte MSEL2bits = 0xDF2
#byte MSEL2 = 0xDF2

typedef union 
 {
      struct {
         unsigned int FIL4_0:2;
         unsigned int FIL5_0:2;
         unsigned int FIL6_0:2;
         unsigned int FIL7_0:2;
      };
      struct {
         unsigned int FIL4_:2;
         unsigned int FIL5_:2;
         unsigned int FIL6_:2;
         unsigned int FIL7_:2;
      };
} MSEL1BITS;
MSEL1BITS MSEL1bits;
#byte MSEL1bits = 0xDF1
#byte MSEL1 = 0xDF1

typedef union 
 {
      struct {
         unsigned int FIL0_0:2;
         unsigned int FIL1_0:2;
         unsigned int FIL2_0:2;
         unsigned int FIL3_0:2;
      };
      struct {
         unsigned int FIL0_:2;
         unsigned int FIL1_:2;
         unsigned int FIL2_:2;
         unsigned int FIL3_:2;
      };
} MSEL0BITS;
MSEL0BITS MSEL0bits;
#byte MSEL0bits = 0xDF0
#byte MSEL0 = 0xDF0

typedef union 
 {
      struct {
         unsigned int F14BP_0:4;
         unsigned int F15BP_0:4;
      };
      struct {
         unsigned int F14BP_:4;
         unsigned int F15BP_:4;
      };
} RXFBCON7BITS;
RXFBCON7BITS RXFBCON7bits;
#byte RXFBCON7bits = 0xDE7
#byte RXFBCON7 = 0xDE7

typedef union 
 {
      struct {
         unsigned int F12BP_0:4;
         unsigned int F13BP_0:4;
      };
      struct {
         unsigned int F12BP_:4;
         unsigned int F13BP_:4;
      };
} RXFBCON6BITS;
RXFBCON6BITS RXFBCON6bits;
#byte RXFBCON6bits = 0xDE6
#byte RXFBCON6 = 0xDE6

typedef union 
 {
      struct {
         unsigned int F10BP_0:4;
         unsigned int F11BP_0:4;
      };
      struct {
         unsigned int F10BP_:4;
         unsigned int F11BP_:4;
      };
} RXFBCON5BITS;
