ammarRajabA/ENC28J60-LAN/CCS_5 C code/TCPIP/PIC18F4585_registers.h
RXFBCON5BITS RXFBCON5bits;
#byte RXFBCON5bits = 0xDE5
#byte RXFBCON5 = 0xDE5

typedef union 
 {
      struct {
         unsigned int F8BP_0:4;
         unsigned int F9BP_0:4;
      };
      struct {
         unsigned int F8BP_:4;
         unsigned int F9BP_:4;
      };
} RXFBCON4BITS;
RXFBCON4BITS RXFBCON4bits;
#byte RXFBCON4bits = 0xDE4
#byte RXFBCON4 = 0xDE4

typedef union 
 {
      struct {
         unsigned int F6BP_0:4;
         unsigned int F7BP_0:4;
      };
      struct {
         unsigned int F6BP_:4;
         unsigned int F7BP_:4;
      };
} RXFBCON3BITS;
RXFBCON3BITS RXFBCON3bits;
#byte RXFBCON3bits = 0xDE3
#byte RXFBCON3 = 0xDE3

typedef union 
 {
      struct {
         unsigned int F4BP_0:4;
         unsigned int F5BP_0:4;
      };
      struct {
         unsigned int F4BP_:4;
         unsigned int F5BP_:4;
      };
} RXFBCON2BITS;
RXFBCON2BITS RXFBCON2bits;
#byte RXFBCON2bits = 0xDE2
#byte RXFBCON2 = 0xDE2

typedef union 
 {
      struct {
         unsigned int F2BP_0:4;
         unsigned int F3BP_0:4;
      };
      struct {
         unsigned int F2BP_:4;
         unsigned int F3BP_:4;
      };
} RXFBCON1BITS;
RXFBCON1BITS RXFBCON1bits;
#byte RXFBCON1bits = 0xDE1
#byte RXFBCON1 = 0xDE1

typedef union 
 {
      struct {
         unsigned int F0BP_0:4;
         unsigned int F1BP_0:4;
      };
      struct {
         unsigned int F0BP_:4;
         unsigned int F1BP_:4;
      };
} RXFBCON0BITS;
RXFBCON0BITS RXFBCON0bits;
#byte RXFBCON0bits = 0xDE0
#byte RXFBCON0 = 0xDE0

#byte SDFLC = 0xDD8

typedef struct 
 {
   unsigned int RXF8EN:1;
   unsigned int RXF9EN:1;
   unsigned int RXF10EN:1;
   unsigned int RXF11EN:1;
   unsigned int RXF12EN:1;
   unsigned int RXF13EN:1;
   unsigned int RXF14EN:1;
   unsigned int RXF15EN:1;
} RXFCON1BITS;
RXFCON1BITS RXFCON1bits;
#byte RXFCON1bits = 0xDD5
#byte RXFCON1 = 0xDD5

typedef struct 
 {
   unsigned int RXF0EN:1;
   unsigned int RXF1EN:1;
   unsigned int RXF2EN:1;
   unsigned int RXF3EN:1;
   unsigned int RXF4EN:1;
   unsigned int RXF5EN:1;
   unsigned int RXF6EN:1;
   unsigned int RXF7EN:1;
} RXFCON0BITS;
RXFCON0BITS RXFCON0bits;
#byte RXFCON0bits = 0xDD4
#byte RXFCON0 = 0xDD4

#byte RXF15EIDL = 0xD93

typedef struct 
 {
   unsigned int EID8:2;
   unsigned int EID10:6;
} RXF15EIDHBITS;
RXF15EIDHBITS RXF15EIDHbits;
#byte RXF15EIDHbits = 0xD92
#byte RXF15EIDH = 0xD92

typedef struct 
 {
   union {
      struct {
         unsigned int :3;
         unsigned int EXIDE:1;
      };

      struct {
         unsigned int EID16:2;
         unsigned int :1;
         unsigned int EXIDEN:1;
         unsigned int :1;
         unsigned int SID0:3;
      };
   };
      struct {
         unsigned int EID1:2;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int SID:3;
      };
} RXF15SIDLBITS;
RXF15SIDLBITS RXF15SIDLbits;
#byte RXF15SIDLbits = 0xD91
#byte RXF15SIDL = 0xD91

typedef struct 
 {
   unsigned int SID3:7;
   unsigned int SID10:1;
} RXF15SIDHBITS;
RXF15SIDHBITS RXF15SIDHbits;
#byte RXF15SIDHbits = 0xD90
#byte RXF15SIDH = 0xD90

#byte RXF14EIDL = 0xD8B

typedef struct 
 {
   unsigned int EID8:2;
   unsigned int EID10:6;
} RXF14EIDHBITS;
RXF14EIDHBITS RXF14EIDHbits;
#byte RXF14EIDHbits = 0xD8A
#byte RXF14EIDH = 0xD8A

typedef union 
 {
   union {
      struct {
         unsigned int EID16:2;
         unsigned int :1;
         unsigned int EXIDEN:1;
         unsigned int :1;
         unsigned int SID0:3;
      };
      struct {
         unsigned int EID1:2;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int SID:3;
      };

      struct {
         unsigned int :3;
         unsigned int EXIDE:1;
      };
   };
} RXF14SIDLBITS;
RXF14SIDLBITS RXF14SIDLbits;
#byte RXF14SIDLbits = 0xD89
#byte RXF14SIDL = 0xD89

typedef struct 
 {
   unsigned int SID3:7;
   unsigned int SID10:1;
} RXF14SIDHBITS;
RXF14SIDHBITS RXF14SIDHbits;
#byte RXF14SIDHbits = 0xD88
#byte RXF14SIDH = 0xD88

#byte RXF13EIDL = 0xD87

typedef struct 
 {
   unsigned int EID8:2;
   unsigned int EID10:6;
} RXF13EIDHBITS;
RXF13EIDHBITS RXF13EIDHbits;
#byte RXF13EIDHbits = 0xD86
#byte RXF13EIDH = 0xD86

typedef union 
 {
   union {
      struct {
         unsigned int EID16:2;
         unsigned int :1;
         unsigned int EXIDEN:1;
         unsigned int :1;
         unsigned int SID0:3;
      };
      struct {
         unsigned int EID1:2;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int SID:3;
      };

      struct {
         unsigned int :3;
         unsigned int EXIDE:1;
      };
   };
} RXF13SIDLBITS;
RXF13SIDLBITS RXF13SIDLbits;
#byte RXF13SIDLbits = 0xD85
#byte RXF13SIDL = 0xD85

typedef struct 
 {
   unsigned int SID3:7;
   unsigned int SID10:1;
} RXF13SIDHBITS;
RXF13SIDHBITS RXF13SIDHbits;
#byte RXF13SIDHbits = 0xD84
#byte RXF13SIDH = 0xD84

#byte RXF12EIDL = 0xD83

typedef struct 
 {
   unsigned int EID8:2;
   unsigned int EID10:6;
} RXF12EIDHBITS;
RXF12EIDHBITS RXF12EIDHbits;
#byte RXF12EIDHbits = 0xD82
#byte RXF12EIDH = 0xD82

typedef struct 
 {
   union {
      struct {
         unsigned int :3;
         unsigned int EXIDE:1;
      };

      struct {
         unsigned int EID16:2;
         unsigned int :1;
         unsigned int EXIDEN:1;
         unsigned int :1;
         unsigned int SID0:3;
      };
   };
      struct {
         unsigned int EID1:2;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int SID:3;
      };
} RXF12SIDLBITS;
RXF12SIDLBITS RXF12SIDLbits;
#byte RXF12SIDLbits = 0xD81
#byte RXF12SIDL = 0xD81

typedef struct 
 {
   unsigned int SID3:7;
   unsigned int SID10:1;
} RXF12SIDHBITS;
RXF12SIDHBITS RXF12SIDHbits;
#byte RXF12SIDHbits = 0xD80
#byte RXF12SIDH = 0xD80

#byte RXF11EIDL = 0xD7B

typedef struct 
 {
   unsigned int EID8:2;
   unsigned int EID10:6;
} RXF11EIDHBITS;
RXF11EIDHBITS RXF11EIDHbits;
#byte RXF11EIDHbits = 0xD7A
#byte RXF11EIDH = 0xD7A

typedef struct 
 {
   union {
      struct {
         unsigned int :3;
         unsigned int EXIDE:1;
      };

