ammarRajabA/ENC28J60-LAN/CCS_5 C code/TCPIP/PIC18F4585_registers.h
      struct {
         unsigned int EID16:2;
         unsigned int :1;
         unsigned int EXIDEN:1;
         unsigned int :1;
         unsigned int SID0:3;
      };
   };
      struct {
         unsigned int EID1:2;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int SID:3;
      };
} RXF11SIDLBITS;
RXF11SIDLBITS RXF11SIDLbits;
#byte RXF11SIDLbits = 0xD79
#byte RXF11SIDL = 0xD79

typedef struct 
 {
   unsigned int SID3:7;
   unsigned int SID10:1;
} RXF11SIDHBITS;
RXF11SIDHBITS RXF11SIDHbits;
#byte RXF11SIDHbits = 0xD78
#byte RXF11SIDH = 0xD78

#byte RXF10EIDL = 0xD77

typedef struct 
 {
   unsigned int EID8:2;
   unsigned int EID10:6;
} RXF10EIDHBITS;
RXF10EIDHBITS RXF10EIDHbits;
#byte RXF10EIDHbits = 0xD76
#byte RXF10EIDH = 0xD76

typedef union 
 {
   union {
      struct {
         unsigned int EID16:2;
         unsigned int :1;
         unsigned int EXIDEN:1;
         unsigned int :1;
         unsigned int SID0:3;
      };
      struct {
         unsigned int EID1:2;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int SID:3;
      };

      struct {
         unsigned int :3;
         unsigned int EXIDE:1;
      };
   };
} RXF10SIDLBITS;
RXF10SIDLBITS RXF10SIDLbits;
#byte RXF10SIDLbits = 0xD75
#byte RXF10SIDL = 0xD75

typedef struct 
 {
   unsigned int SID3:7;
   unsigned int SID10:1;
} RXF10SIDHBITS;
RXF10SIDHBITS RXF10SIDHbits;
#byte RXF10SIDHbits = 0xD74
#byte RXF10SIDH = 0xD74

#byte RXF9EIDL = 0xD73

typedef struct 
 {
   unsigned int EID8:2;
   unsigned int EID10:6;
} RXF9EIDHBITS;
RXF9EIDHBITS RXF9EIDHbits;
#byte RXF9EIDHbits = 0xD72
#byte RXF9EIDH = 0xD72

typedef struct 
 {
   union {
      struct {
         unsigned int :3;
         unsigned int EXIDE:1;
      };

      struct {
         unsigned int EID16:2;
         unsigned int :1;
         unsigned int EXIDEN:1;
         unsigned int :1;
         unsigned int SID0:3;
      };
   };
      struct {
         unsigned int EID1:2;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int SID:3;
      };
} RXF9SIDLBITS;
RXF9SIDLBITS RXF9SIDLbits;
#byte RXF9SIDLbits = 0xD71
#byte RXF9SIDL = 0xD71

typedef struct 
 {
   unsigned int SID3:7;
   unsigned int SID10:1;
} RXF9SIDHBITS;
RXF9SIDHBITS RXF9SIDHbits;
#byte RXF9SIDHbits = 0xD70
#byte RXF9SIDH = 0xD70

#byte RXF8EIDL = 0xD6B

typedef struct 
 {
   unsigned int EID8:2;
   unsigned int EID10:6;
} RXF8EIDHBITS;
RXF8EIDHBITS RXF8EIDHbits;
#byte RXF8EIDHbits = 0xD6A
#byte RXF8EIDH = 0xD6A

typedef struct 
 {
   union {
      struct {
         unsigned int :3;
         unsigned int EXIDE:1;
      };

      struct {
         unsigned int EID16:2;
         unsigned int :1;
         unsigned int EXIDEN:1;
         unsigned int :1;
         unsigned int SID0:3;
      };
   };
      struct {
         unsigned int EID1:2;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int SID:3;
      };
} RXF8SIDLBITS;
RXF8SIDLBITS RXF8SIDLbits;
#byte RXF8SIDLbits = 0xD69
#byte RXF8SIDL = 0xD69

typedef struct 
 {
   unsigned int SID3:7;
   unsigned int SID10:1;
} RXF8SIDHBITS;
RXF8SIDHBITS RXF8SIDHbits;
#byte RXF8SIDHbits = 0xD68
#byte RXF8SIDH = 0xD68

#byte RXF7EIDL = 0xD67

typedef struct 
 {
   unsigned int EID8:2;
   unsigned int EID10:6;
} RXF7EIDHBITS;
RXF7EIDHBITS RXF7EIDHbits;
#byte RXF7EIDHbits = 0xD66
#byte RXF7EIDH = 0xD66

typedef union 
 {
   union {
      struct {
         unsigned int EID16:2;
         unsigned int :1;
         unsigned int EXIDEN:1;
         unsigned int :1;
         unsigned int SID0:3;
      };
      struct {
         unsigned int EID1:2;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int SID:3;
      };

      struct {
         unsigned int :3;
         unsigned int EXIDE:1;
      };
   };
} RXF7SIDLBITS;
RXF7SIDLBITS RXF7SIDLbits;
#byte RXF7SIDLbits = 0xD65
#byte RXF7SIDL = 0xD65

typedef struct 
 {
   unsigned int SID3:7;
   unsigned int SID10:1;
} RXF7SIDHBITS;
RXF7SIDHBITS RXF7SIDHbits;
#byte RXF7SIDHbits = 0xD64
#byte RXF7SIDH = 0xD64

#byte RXF6EIDL = 0xD63

typedef struct 
 {
   unsigned int EID8:2;
   unsigned int EID10:6;
} RXF6EIDHBITS;
RXF6EIDHBITS RXF6EIDHbits;
#byte RXF6EIDHbits = 0xD62
#byte RXF6EIDH = 0xD62

typedef struct 
 {
   union {
      struct {
         unsigned int :3;
         unsigned int EXIDE:1;
      };

      struct {
         unsigned int EID16:2;
         unsigned int :1;
         unsigned int EXIDEN:1;
         unsigned int :1;
         unsigned int SID0:3;
      };
   };
      struct {
         unsigned int EID1:2;
         unsigned int :1;
         unsigned int :1;
         unsigned int :1;
         unsigned int SID:3;
      };
} RXF6SIDLBITS;
RXF6SIDLBITS RXF6SIDLbits;
#byte RXF6SIDLbits = 0xD61
#byte RXF6SIDL = 0xD61

typedef struct 
 {
   unsigned int SID3:7;
   unsigned int SID10:1;
} RXF6SIDHBITS;
RXF6SIDHBITS RXF6SIDHbits;
#byte RXF6SIDHbits = 0xD60
#byte RXF6SIDH = 0xD60

